<script setup >
    //import { computed, onMounted } from 'vue';
    //import validator from 'validator';
    //import { BBadge,BRow,BCol,BFormInput,BFormFile,BFormSelect,BInputGroup,BInputGroupText,BFormTextarea,BFormRadioGroup,BFormCheckboxGroup,BFormCheckbox,BButton } from "bootstrap-vue-next";
    // -----------------------------------------------
    // v-modelに親コンポーネントで定義したデータ（ref/reactive）を指定する際に使用
    // -----------------------------------------------
    //const dm_model = defineModel()
    // -----------------------------------------------
    // 親コンポーネントから子コンポーネントへデータを受け渡す
    // -----------------------------------------------
    // const props = defineProps({
    //     item_type: {
    //         type: String,
    //         required: true,
    //     },
    // })
    // -----------------------------------------------
    // ローカル変数
    // -----------------------------------------------
    // ブラウザからデフォルトの言語を取得する
    // -----------------------------------------------
    // 既定計算
    // -----------------------------------------------
    // 短文テキスト
    // const state_item_text = computed(() => {})
    // -----------------------------------------------
    // コンポーネントがマウントされる直前に呼び出されるフックを登録します。
    // -----------------------------------------------
    // onBeforeMount()
    // -----------------------------------------------
    // コンポーネントがマウントされた後に呼び出されるコールバックを登録します。
    // -----------------------------------------------
    // onMounted(() => {})
    // -----------------------------------------------
    // コンポーネントがリアクティブな状態変更により DOM ツリーを更新しようとする直前に呼び出されるフックを登録します。
    // -----------------------------------------------
    // onBeforeUpdate()
    // -----------------------------------------------
    // コンポーネントがリアクティブな状態変更によって DOM ツリーを更新した後に呼び出されるコールバックを登録します。
    // -----------------------------------------------
    // onUpdated();
    // -----------------------------------------------
    // コンポーネントインスタンスがアンマウントされる直前に呼び出されるフックを登録します。
    // -----------------------------------------------
    // onBeforeUnmount()
    // -----------------------------------------------
    // コンポーネントがアンマウントされた後に呼び出されるコールバックを登録します。
    // -----------------------------------------------
    // onUnmounted()
    // -----------------------------------------------
    // 子孫コンポーネントから伝搬するエラーをキャプチャーしたときに呼び出されるフックを登録します。
    // -----------------------------------------------
    // onErrorCaptured()
    // formatter
    //const datetimeFormatter = (value) => moment(value).tz('Asia/Tokyo').format("YYYY/MM/DD HH:mm")
    
    // -----------------------------------------------
    // ローカル関数
    // -----------------------------------------------
    //const required = (in_model) => {}
    
</script>

<template>
    
</template>
<style>

</style>